#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/thclpr/default/runs/run-Pa8V2BUAo8EM1tD7

Waiting for the plan to start...

Terraform v1.0.9
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # helm_release.releases will be created
  + resource "helm_release" "releases" {
      + atomic                     = false
      + chart                      = "ingress-nginx"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "ingress-nginx"
      + namespace                  = "kube-system"
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://kubernetes.github.io/ingress-nginx"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "4.0.6"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # kubernetes_ingress.ingress["nodeapi"] will be created
  + resource "kubernetes_ingress" "ingress" {
      + id     = (known after apply)
      + status = (known after apply)

      + metadata {
          + annotations      = {
              + "ingress.kubernetes.io/rewrite-target" = "/"
              + "kubernetes.io/ingress.class"          = "nginx"
            }
          + generation       = (known after apply)
          + name             = "nodeapi"
          + namespace        = "app"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {

          + rule {
              + http {
                  + path {
                      + path = "/"

                      + backend {
                          + service_name = "nodeapi"
                          + service_port = "3000"
                        }
                    }
                }
            }
        }
    }

  # module.aks.azurerm_kubernetes_cluster.k8 will be created
  + resource "azurerm_kubernetes_cluster" "k8" {
      + dns_prefix                          = "aks-default"
      + fqdn                                = (known after apply)
      + id                                  = (known after apply)
      + kube_admin_config                   = (known after apply)
      + kube_admin_config_raw               = (sensitive value)
      + kube_config                         = (known after apply)
      + kube_config_raw                     = (sensitive value)
      + kubernetes_version                  = "1.21.2"
      + location                            = "northeurope"
      + name                                = "aks-default"
      + node_resource_group                 = "aks-nodes-default-rg"
      + private_cluster_enabled             = false
      + private_cluster_public_fqdn_enabled = false
      + private_dns_zone_id                 = (known after apply)
      + private_fqdn                        = (known after apply)
      + private_link_enabled                = (known after apply)
      + resource_group_name                 = "aks-default-rg"
      + sku_tier                            = "Free"
      + tags                                = {
          + "module_version" = "local"
          + "source"         = "terraform"
          + "workspace"      = "default"
        }

      + addon_profile {
          + aci_connector_linux {
              + enabled     = (known after apply)
              + subnet_name = (known after apply)
            }

          + azure_policy {
              + enabled = (known after apply)
            }

          + http_application_routing {
              + enabled                            = (known after apply)
              + http_application_routing_zone_name = (known after apply)
            }

          + ingress_application_gateway {
              + effective_gateway_id                 = (known after apply)
              + enabled                              = (known after apply)
              + gateway_id                           = (known after apply)
              + gateway_name                         = (known after apply)
              + ingress_application_gateway_identity = (known after apply)
              + subnet_cidr                          = (known after apply)
              + subnet_id                            = (known after apply)
            }

          + kube_dashboard {
              + enabled = (known after apply)
            }

          + oms_agent {
              + enabled                    = (known after apply)
              + log_analytics_workspace_id = (known after apply)
              + oms_agent_identity         = (known after apply)
            }
        }

      + auto_scaler_profile {
          + balance_similar_node_groups      = (known after apply)
          + empty_bulk_delete_max            = (known after apply)
          + expander                         = (known after apply)
          + max_graceful_termination_sec     = (known after apply)
          + max_node_provisioning_time       = (known after apply)
          + max_unready_nodes                = (known after apply)
          + max_unready_percentage           = (known after apply)
          + new_pod_scale_up_delay           = (known after apply)
          + scale_down_delay_after_add       = (known after apply)
          + scale_down_delay_after_delete    = (known after apply)
          + scale_down_delay_after_failure   = (known after apply)
          + scale_down_unneeded              = (known after apply)
          + scale_down_unready               = (known after apply)
          + scale_down_utilization_threshold = (known after apply)
          + scan_interval                    = (known after apply)
          + skip_nodes_with_local_storage    = (known after apply)
          + skip_nodes_with_system_pods      = (known after apply)
        }

      + default_node_pool {
          + availability_zones   = [
              + "1",
            ]
          + enable_auto_scaling  = false
          + kubelet_disk_type    = (known after apply)
          + max_pods             = 30
          + name                 = "sys"
          + node_count           = 1
          + node_labels          = (known after apply)
          + orchestrator_version = (known after apply)
          + os_disk_size_gb      = 32
          + os_disk_type         = "Managed"
          + os_sku               = (known after apply)
          + type                 = "VirtualMachineScaleSets"
          + ultra_ssd_enabled    = false
          + vm_size              = "standard_B2s"
          + vnet_subnet_id       = (known after apply)
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + kubelet_identity {
          + client_id                 = (known after apply)
          + object_id                 = (known after apply)
          + user_assigned_identity_id = (known after apply)
        }

      + network_profile {
          + dns_service_ip     = (known after apply)
          + docker_bridge_cidr = (known after apply)
          + load_balancer_sku  = "Standard"
          + network_mode       = (known after apply)
          + network_plugin     = "kubenet"
          + network_policy     = (known after apply)
          + outbound_type      = "loadBalancer"
          + pod_cidr           = (known after apply)
          + service_cidr       = (known after apply)

          + load_balancer_profile {
              + effective_outbound_ips    = (known after apply)
              + idle_timeout_in_minutes   = (known after apply)
              + managed_outbound_ip_count = (known after apply)
              + outbound_ip_address_ids   = (known after apply)
              + outbound_ip_prefix_ids    = (known after apply)
              + outbound_ports_allocated  = (known after apply)
            }
        }

      + role_based_access_control {
          + enabled = (known after apply)

          + azure_active_directory {
              + admin_group_object_ids = (known after apply)
              + azure_rbac_enabled     = (known after apply)
              + client_app_id          = (known after apply)
              + managed                = (known after apply)
              + server_app_id          = (known after apply)
              + server_app_secret      = (sensitive value)
              + tenant_id              = (known after apply)
            }
        }

      + windows_profile {
          + admin_password = (sensitive value)
          + admin_username = (known after apply)
          + license        = (known after apply)
        }
    }

  # module.aks_deployment["nodeapi"].kubernetes_deployment.deploy will be created
  + resource "kubernetes_deployment" "deploy" {
      + id               = (known after apply)
      + wait_for_rollout = true

      + metadata {
          + generation       = (known after apply)
          + name             = "dev"
          + namespace        = "app"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + min_ready_seconds         = 0
          + paused                    = false
          + progress_deadline_seconds = 600
          + replicas                  = "3"
          + revision_history_limit    = 10

          + selector {
              + match_labels = {
                  + "app" = "dev"
                }
            }

          + strategy {
              + type = (known after apply)

              + rolling_update {
                  + max_surge       = (known after apply)
                  + max_unavailable = (known after apply)
                }
            }

          + template {
              + metadata {
                  + generation       = (known after apply)
                  + labels           = {
                      + "app" = "dev"
                    }
                  + name             = (known after apply)
                  + resource_version = (known after apply)
                  + uid              = (known after apply)
                }

              + spec {
                  + automount_service_account_token  = true
                  + dns_policy                       = "ClusterFirst"
                  + enable_service_links             = true
                  + host_ipc                         = false
                  + host_network                     = false
                  + host_pid                         = false
                  + hostname                         = (known after apply)
                  + node_name                        = (known after apply)
                  + restart_policy                   = "Always"
                  + service_account_name             = (known after apply)
                  + share_process_namespace          = false
                  + termination_grace_period_seconds = 30

                  + affinity {
                      + node_affinity {

                          + required_during_scheduling_ignored_during_execution {
                              + node_selector_term {
                                  + match_expressions {
                                      + key      = "agentpool"
                                      + operator = "In"
                                      + values   = [
                                          + "sys",
                                          + "user",
                                        ]
                                    }
                                }
                            }
                        }

                      + pod_anti_affinity {
                          + preferred_during_scheduling_ignored_during_execution {
                              + weight = 100

                              + pod_affinity_term {
                                  + topology_key = "kubernetes.io/hostname"

                                  + label_selector {
                                      + match_expressions {
                                          + key      = "nodeapi"
                                          + operator = "In"
                                          + values   = [
                                              + "dev",
                                            ]
                                        }
                                    }
                                }
                            }
                        }
                    }

                  + container {
                      + image                      = "thclpr/nodeapi:1.0.0"
                      + image_pull_policy          = (known after apply)
                      + name                       = "nodeapi"
                      + stdin                      = false
                      + stdin_once                 = false
                      + termination_message_path   = "/dev/termination-log"
                      + termination_message_policy = (known after apply)
                      + tty                        = false

                      + liveness_probe {
                          + failure_threshold     = 3
                          + initial_delay_seconds = 3
                          + period_seconds        = 3
                          + success_threshold     = 1
                          + timeout_seconds       = 1

                          + http_get {
                              + path   = "/"
                              + port   = "3000"
                              + scheme = "HTTP"
                            }
                        }

                      + port {
                          + container_port = 3000
                          + name           = "http"
                          + protocol       = "TCP"
                        }

                      + resources {
                          + limits   = {
                              + "cpu"    = "40m"
                              + "memory" = "512Mi"
                            }
                          + requests = {
                              + "cpu"    = "10m"
                              + "memory" = "1Mi"
                            }
                        }
                    }

                  + image_pull_secrets {
                      + name = (known after apply)
                    }

                  + readiness_gate {
                      + condition_type = (known after apply)
                    }

                  + volume {
                      + name = (known after apply)

                      + aws_elastic_block_store {
                          + fs_type   = (known after apply)
                          + partition = (known after apply)
                          + read_only = (known after apply)
                          + volume_id = (known after apply)
                        }

                      + azure_disk {
                          + caching_mode  = (known after apply)
                          + data_disk_uri = (known after apply)
                          + disk_name     = (known after apply)
                          + fs_type       = (known after apply)
                          + kind          = (known after apply)
                          + read_only     = (known after apply)
                        }

                      + azure_file {
                          + read_only        = (known after apply)
                          + secret_name      = (known after apply)
                          + secret_namespace = (known after apply)
                          + share_name       = (known after apply)
                        }

                      + ceph_fs {
                          + monitors    = (known after apply)
                          + path        = (known after apply)
                          + read_only   = (known after apply)
                          + secret_file = (known after apply)
                          + user        = (known after apply)

                          + secret_ref {
                              + name      = (known after apply)
                              + namespace = (known after apply)
                            }
                        }

                      + cinder {
                          + fs_type   = (known after apply)
                          + read_only = (known after apply)
                          + volume_id = (known after apply)
                        }

                      + config_map {
                          + default_mode = (known after apply)
                          + name         = (known after apply)
                          + optional     = (known after apply)

                          + items {
                              + key  = (known after apply)
                              + mode = (known after apply)
                              + path = (known after apply)
                            }
                        }

                      + csi {
                          + driver            = (known after apply)
                          + fs_type           = (known after apply)
                          + read_only         = (known after apply)
                          + volume_attributes = (known after apply)
                          + volume_handle     = (known after apply)

                          + controller_expand_secret_ref {
                              + name      = (known after apply)
                              + namespace = (known after apply)
                            }

                          + controller_publish_secret_ref {
                              + name      = (known after apply)
                              + namespace = (known after apply)
                            }

                          + node_publish_secret_ref {
                              + name      = (known after apply)
                              + namespace = (known after apply)
                            }

                          + node_stage_secret_ref {
                              + name      = (known after apply)
                              + namespace = (known after apply)
                            }
                        }

                      + downward_api {
                          + default_mode = (known after apply)

                          + items {
                              + mode = (known after apply)
                              + path = (known after apply)

                              + field_ref {
                                  + api_version = (known after apply)
                                  + field_path  = (known after apply)
                                }

                              + resource_field_ref {
                                  + container_name = (known after apply)
                                  + divisor        = (known after apply)
                                  + resource       = (known after apply)
                                }
                            }
                        }

                      + empty_dir {
                          + medium     = (known after apply)
                          + size_limit = (known after apply)
                        }

                      + fc {
                          + fs_type      = (known after apply)
                          + lun          = (known after apply)
                          + read_only    = (known after apply)
                          + target_ww_ns = (known after apply)
                        }

                      + flex_volume {
                          + driver    = (known after apply)
                          + fs_type   = (known after apply)
                          + options   = (known after apply)
                          + read_only = (known after apply)

                          + secret_ref {
                              + name      = (known after apply)
                              + namespace = (known after apply)
                            }
                        }

                      + flocker {
                          + dataset_name = (known after apply)
                          + dataset_uuid = (known after apply)
                        }

                      + gce_persistent_disk {
                          + fs_type   = (known after apply)
                          + partition = (known after apply)
                          + pd_name   = (known after apply)
                          + read_only = (known after apply)
                        }

                      + git_repo {
                          + directory  = (known after apply)
                          + repository = (known after apply)
                          + revision   = (known after apply)
                        }

                      + glusterfs {
                          + endpoints_name = (known after apply)
                          + path           = (known after apply)
                          + read_only      = (known after apply)
                        }

                      + host_path {
                          + path = (known after apply)
                          + type = (known after apply)
                        }

                      + iscsi {
                          + fs_type         = (known after apply)
                          + iqn             = (known after apply)
                          + iscsi_interface = (known after apply)
                          + lun             = (known after apply)
                          + read_only       = (known after apply)
                          + target_portal   = (known after apply)
                        }

                      + local {
                          + path = (known after apply)
                        }

                      + nfs {
                          + path      = (known after apply)
                          + read_only = (known after apply)
                          + server    = (known after apply)
                        }

                      + persistent_volume_claim {
                          + claim_name = (known after apply)
                          + read_only  = (known after apply)
                        }

                      + photon_persistent_disk {
                          + fs_type = (known after apply)
                          + pd_id   = (known after apply)
                        }

                      + projected {
                          + default_mode = (known after apply)

                          + sources {
                              + config_map {
                                  + name     = (known after apply)
                                  + optional = (known after apply)

                                  + items {
                                      + key  = (known after apply)
                                      + mode = (known after apply)
                                      + path = (known after apply)
                                    }
                                }

                              + downward_api {
                                  + items {
                                      + mode = (known after apply)
                                      + path = (known after apply)

                                      + field_ref {
                                          + api_version = (known after apply)
                                          + field_path  = (known after apply)
                                        }

                                      + resource_field_ref {
                                          + container_name = (known after apply)
                                          + divisor        = (known after apply)
                                          + resource       = (known after apply)
                                        }
                                    }
                                }

                              + secret {
                                  + name     = (known after apply)
                                  + optional = (known after apply)

                                  + items {
                                      + key  = (known after apply)
                                      + mode = (known after apply)
                                      + path = (known after apply)
                                    }
                                }

                              + service_account_token {
                                  + audience           = (known after apply)
                                  + expiration_seconds = (known after apply)
                                  + path               = (known after apply)
                                }
                            }
                        }

                      + quobyte {
                          + group     = (known after apply)
                          + read_only = (known after apply)
                          + registry  = (known after apply)
                          + user      = (known after apply)
                          + volume    = (known after apply)
                        }

                      + rbd {
                          + ceph_monitors = (known after apply)
                          + fs_type       = (known after apply)
                          + keyring       = (known after apply)
                          + rados_user    = (known after apply)
                          + rbd_image     = (known after apply)
                          + rbd_pool      = (known after apply)
                          + read_only     = (known after apply)

                          + secret_ref {
                              + name      = (known after apply)
                              + namespace = (known after apply)
                            }
                        }

                      + secret {
                          + default_mode = (known after apply)
                          + optional     = (known after apply)
                          + secret_name  = (known after apply)

                          + items {
                              + key  = (known after apply)
                              + mode = (known after apply)
                              + path = (known after apply)
                            }
                        }

                      + vsphere_volume {
                          + fs_type     = (known after apply)
                          + volume_path = (known after apply)
                        }
                    }
                }
            }
        }
    }

  # module.aks_hpa["nodeapi"].kubernetes_horizontal_pod_autoscaler.hpa will be created
  + resource "kubernetes_horizontal_pod_autoscaler" "hpa" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "nodeapi"
          + namespace        = "app"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + max_replicas                      = 20
          + min_replicas                      = 3
          + target_cpu_utilization_percentage = (known after apply)

          + behavior {
              + scale_down {
                  + select_policy                = "Min"
                  + stabilization_window_seconds = 10

                  + policy {
                      + period_seconds = 5
                      + type           = "Percent"
                      + value          = 100
                    }
                }

              + scale_up {
                  + select_policy                = "Max"
                  + stabilization_window_seconds = 10

                  + policy {
                      + period_seconds = 5
                      + type           = "Percent"
                      + value          = 90
                    }
                }
            }

          + metric {
              + type = (known after apply)

              + external {
                  + metric {
                      + name = (known after apply)

                      + selector {
                          + match_labels = (known after apply)

                          + match_expressions {
                              + key      = (known after apply)
                              + operator = (known after apply)
                              + values   = (known after apply)
                            }
                        }
                    }

                  + target {
                      + average_utilization = (known after apply)
                      + average_value       = (known after apply)
                      + type                = (known after apply)
                      + value               = (known after apply)
                    }
                }

              + object {
                  + described_object {
                      + api_version = (known after apply)
                      + kind        = (known after apply)
                      + name        = (known after apply)
                    }

                  + metric {
                      + name = (known after apply)

                      + selector {
                          + match_labels = (known after apply)

                          + match_expressions {
                              + key      = (known after apply)
                              + operator = (known after apply)
                              + values   = (known after apply)
                            }
                        }
                    }

                  + target {
                      + average_utilization = (known after apply)
                      + average_value       = (known after apply)
                      + type                = (known after apply)
                      + value               = (known after apply)
                    }
                }

              + pods {
                  + metric {
                      + name = (known after apply)

                      + selector {
                          + match_labels = (known after apply)

                          + match_expressions {
                              + key      = (known after apply)
                              + operator = (known after apply)
                              + values   = (known after apply)
                            }
                        }
                    }

                  + target {
                      + average_utilization = (known after apply)
                      + average_value       = (known after apply)
                      + type                = (known after apply)
                      + value               = (known after apply)
                    }
                }

              + resource {
                  + name = (known after apply)

                  + target {
                      + average_utilization = (known after apply)
                      + average_value       = (known after apply)
                      + type                = (known after apply)
                      + value               = (known after apply)
                    }
                }
            }

          + scale_target_ref {
              + api_version = "apps/v1"
              + kind        = "Deployment"
              + name        = "nodeapi"
            }
        }
    }

  # module.aks_namespace["app"].kubernetes_namespace.ns will be created
  + resource "kubernetes_namespace" "ns" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "app"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.aks_nodepool["user"].azurerm_kubernetes_cluster_node_pool.pool will be created
  + resource "azurerm_kubernetes_cluster_node_pool" "pool" {
      + availability_zones    = [
          + "1",
        ]
      + enable_auto_scaling   = true
      + enable_node_public_ip = false
      + id                    = (known after apply)
      + kubelet_disk_type     = (known after apply)
      + kubernetes_cluster_id = (known after apply)
      + max_count             = 1
      + max_pods              = 15
      + min_count             = 0
      + mode                  = "User"
      + name                  = "user"
      + node_count            = 0
      + node_labels           = (known after apply)
      + node_taints           = []
      + orchestrator_version  = (known after apply)
      + os_disk_size_gb       = 30
      + os_disk_type          = "Managed"
      + os_sku                = (known after apply)
      + os_type               = "Linux"
      + priority              = "Regular"
      + spot_max_price        = -1
      + tags                  = {
          + "module_version" = "local"
          + "source"         = "terraform"
          + "workspace"      = "default"
        }
      + ultra_ssd_enabled     = false
      + vm_size               = "Standard_B2s"
      + vnet_subnet_id        = (known after apply)
    }

  # module.aks_role["nodeapi"].kubernetes_role.r will be created
  + resource "kubernetes_role" "r" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "app" = "nodeapi"
            }
          + name             = "nodeapi"
          + namespace        = "default"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + rule {
          + api_groups = [
              + "",
            ]
          + resources  = [
              + "pods",
            ]
          + verbs      = [
              + "get",
            ]
        }
    }

  # module.aks_role_binding["nodeapi"].kubernetes_role_binding.rb will be created
  + resource "kubernetes_role_binding" "rb" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "app" = "nodeapi"
            }
          + name             = "nodeapi"
          + namespace        = "app"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + role_ref {
          + api_group = "rbac.authorization.k8s.io"
          + kind      = "Role"
          + name      = "nodeapi"
        }

      + subject {
          + api_group = (known after apply)
          + kind      = "ServiceAccount"
          + name      = "nodeapi"
          + namespace = "app"
        }
    }

  # module.aks_service["nodeapi"].kubernetes_service.svc will be created
  + resource "kubernetes_service" "svc" {
      + id                     = (known after apply)
      + status                 = (known after apply)
      + wait_for_load_balancer = true

      + metadata {
          + generation       = (known after apply)
          + name             = "nodeapi"
          + namespace        = "app"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + cluster_ip                  = (known after apply)
          + external_traffic_policy     = (known after apply)
          + health_check_node_port      = (known after apply)
          + publish_not_ready_addresses = false
          + selector                    = {
              + "app" = "nodeapi"
            }
          + session_affinity            = "ClientIP"
          + type                        = "ClusterIP"

          + port {
              + name        = "http"
              + node_port   = (known after apply)
              + port        = 3000
              + protocol    = "TCP"
              + target_port = "3000"
            }
        }
    }

  # module.aks_service_account["nodeapi"].kubernetes_service_account.sa will be created
  + resource "kubernetes_service_account" "sa" {
      + automount_service_account_token = true
      + default_secret_name             = (known after apply)
      + id                              = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "app" = "nodeapi"
            }
          + name             = "nodeapi"
          + namespace        = "app"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.nsg_rules["allow_http"].azurerm_network_security_rule.nsr will be created
  + resource "azurerm_network_security_rule" "nsr" {
      + access                      = "Allow"
      + destination_address_prefix  = "*"
      + destination_port_ranges     = [
          + "80",
        ]
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "allow_http"
      + network_security_group_name = "nsg-default"
      + priority                    = 100
      + protocol                    = "tcp"
      + resource_group_name         = "vnet-default-rg"
      + source_address_prefixes     = [
          + "0.0.0.0/0",
        ]
      + source_port_range           = "*"
    }

  # module.rg_aks.azurerm_resource_group.rg will be created
  + resource "azurerm_resource_group" "rg" {
      + id       = (known after apply)
      + location = "northeurope"
      + name     = "aks-default-rg"
      + tags     = {
          + "module_version" = "local"
          + "source"         = "terraform"
          + "workspace"      = "default"
        }
    }

  # module.rg_vnet.azurerm_resource_group.rg will be created
  + resource "azurerm_resource_group" "rg" {
      + id       = (known after apply)
      + location = "northeurope"
      + name     = "vnet-default-rg"
      + tags     = {
          + "module_version" = "local"
          + "source"         = "terraform"
          + "workspace"      = "default"
        }
    }

  # module.vnet.azurerm_network_security_group.nsg will be created
  + resource "azurerm_network_security_group" "nsg" {
      + id                  = (known after apply)
      + location            = "northeurope"
      + name                = "nsg-default"
      + resource_group_name = "vnet-default-rg"
      + security_rule       = (known after apply)
      + tags                = {
          + "module_version" = "local"
          + "source"         = "terraform"
          + "workspace"      = "default"
        }
    }

  # module.vnet.azurerm_subnet.subnet["nodes"] will be created
  + resource "azurerm_subnet" "subnet" {
      + address_prefix                                 = (known after apply)
      + address_prefixes                               = [
          + "10.5.0.0/26",
        ]
      + enforce_private_link_endpoint_network_policies = false
      + enforce_private_link_service_network_policies  = false
      + id                                             = (known after apply)
      + name                                           = "nodes"
      + resource_group_name                            = "vnet-default-rg"
      + virtual_network_name                           = "vnet-default"
    }

  # module.vnet.azurerm_subnet_network_security_group_association.nsga["nodes"] will be created
  + resource "azurerm_subnet_network_security_group_association" "nsga" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = (known after apply)
    }

  # module.vnet.azurerm_virtual_network.vnet will be created
  + resource "azurerm_virtual_network" "vnet" {
      + address_space         = [
          + "10.5.0.0/18",
        ]
      + dns_servers           = []
      + guid                  = (known after apply)
      + id                    = (known after apply)
      + location              = "northeurope"
      + name                  = "vnet-default"
      + resource_group_name   = "vnet-default-rg"
      + subnet                = (known after apply)
      + tags                  = {
          + "module_version" = "local"
          + "source"         = "terraform"
          + "workspace"      = "default"
        }
      + vm_protection_enabled = false
    }

Plan: 18 to add, 0 to change, 0 to destroy.


```

</details>

*Pusher: @thcp, Action: `pull_request`*